In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [7]:
dict2={"Names":["aravind","sammar",None,"siri"],"age":[np.nan,21,32,43],'city':["hyd","blr","chennai",None]}
dict2

{'Names': ['aravind', 'sammar', None, 'siri'],
 'age': [nan, 21, 32, 43],
 'city': ['hyd', 'blr', 'chennai', None]}

In [10]:
d2=pd.DataFrame(dict2)

In [12]:
d2

     Names   age     city
0  aravind   NaN      hyd
1   sammar  21.0      blr
2     None  32.0  chennai
3     siri  43.0     None

In [13]:
d1.isnull()

   Names    age   city
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [14]:
d.isnull().sum()

Names    1
age      1
city     1
dtype: int64

- np.nan: not a number this applicable for numerical columns  only

- it is  a data problem
- if you read that kind of data you will see Null
- YOU need to understand it is a data corrupted or really a Null valuer are therem

*METHOD-1*

**File with some random values**

In [16]:
d1.fillna(40)

     Names   age     city
0  aravind  40.0      hyd
1   sammar  21.0      blr
2       40  32.0  chennai
3     siri  43.0       40

# method -2

- we can fill the values w.r.t columns also

In [17]:
d1["age"].fillna(40)

0    40.0
1    21.0
2    32.0
3    43.0
Name: age, dtype: float64

In [18]:
d1

     Names   age     city
0  aravind   NaN      hyd
1   sammar  21.0      blr
2     None  32.0  chennai
3     siri  43.0     None

In [20]:
d1["age"].fillna(40,inplace=True)

In [21]:
d1

     Names   age     city
0  aravind  40.0      hyd
1   sammar  21.0      blr
2     None  32.0  chennai
3     siri  43.0     None

In [30]:
d1["Names"].fillna("happy",inplace=True)

In [31]:
d1

     Names   age     city
0  aravind  40.0      hyd
1   sammar  21.0      blr
2       40  32.0  chennai
3     siri  43.0     None

In [29]:
d1.fillna(method="bfill")

C:\Users\Admin\AppData\Local\Temp\ipykernel_3016\2947328357.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method="bfill")

     Names   age     city
0  aravind  40.0      hyd
1   sammar  21.0      blr
2       40  32.0  chennai
3     siri  43.0     None

In [32]:
d1.fillna(method="ffill")

C:\Users\Admin\AppData\Local\Temp\ipykernel_3016\4243749665.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method="ffill")

     Names   age     city
0  aravind  40.0      hyd
1   sammar  21.0      blr
2       40  32.0  chennai
3     siri  43.0  chennai

In [37]:
d1.fillna(method="backfill",axis=1)

C:\Users\Admin\AppData\Local\Temp\ipykernel_3016\1445519270.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method="backfill",axis=1)

     Names   age     city
0  aravind  40.0      hyd
1   sammar  21.0      blr
2       40  32.0  chennai
3     siri  43.0     None

- backfill and bill fill with next value
- pad and ffill fill with previous value
- but it will change balsed on axism

**mean
  meadian
  mode**

- numarical value fill with mean value
- but mean gets affected by mean
- if we dont have outliers it is best one nar
 *median*

In [40]:
dict2={"Names":["aravind","sammar",None,"siri"],"age":[np.nan,21,32,43],'city':["hyd","blr","chennai",None]}
dict2

{'Names': ['aravind', 'sammar', None, 'siri'],
 'age': [nan, 21, 32, 43],
 'city': ['hyd', 'blr', 'chennai', None]}

In [42]:
d1=pd.DataFrame(dict2)
d1

     Names   age     city
0  aravind   NaN      hyd
1   sammar  21.0      blr
2     None  32.0  chennai
3     siri  43.0     None

In [43]:
age_mean=d1["age"].mean()
d1["age"].fillna(age_mean)

0    32.0
1    21.0
2    32.0
3    43.0
Name: age, dtype: float64

In [44]:
age_median=d1["age"].median()
d1["age"].fillna(age_median)

0    32.0
1    21.0
2    32.0
3    43.0
Name: age, dtype: float64

***Method-5***
***knn imputer***
- knn: k neartest neighbours
- k is a hyper

In [47]:
from sklearn.impute import KNNImputer
KI=KNNImputer()
KI.fit_transform(d1[["age"]])

array([[32.],
       [21.],
       [32.],
       [43.]])